liebherrnenzing/canpie-fd_device/stm32/f1/hal/stm32f1xx_canpie-fd.c
	return (tvStatusT);
}

//----------------------------------------------------------------------------//
// CpCoreBufferSend()                                                         //
// send message out of the CAN controller                                     //
//----------------------------------------------------------------------------//
CpStatus_tv CpCoreBufferSend(CpPort_ts * ptsPortV, uint8_t ubBufferIdxV)
{
	uint8_t i;
	CpStatus_tv tvStatusT;

	//----------------------------------------------------------------
	// test parameter ptsPortV and ubBufferIdxV
	//
	tvStatusT = CheckParam(ptsPortV, ubBufferIdxV, eDRV_INFO_INIT);
	if (tvStatusT == eCP_ERR_NONE)
	{
		//-----------------------------------------------------------------
		// setup identifier
		//
		if (CpMsgIsExtended(&atsCanMsgS[ubBufferIdxV]))
		{
			HCAN1.pTxMsg->ExtId = atsCanMsgS[ubBufferIdxV].ulIdentifier;
			HCAN1.pTxMsg->IDE = CAN_ID_EXT;
		}
		else
		{
			HCAN1.pTxMsg->StdId = atsCanMsgS[ubBufferIdxV].ulIdentifier;
			HCAN1.pTxMsg->IDE = CAN_ID_STD;
		}

		//-----------------------------------------------------------------
		// check for RTR bit
		//
		if (CpMsgIsRemote(&atsCanMsgS[ubBufferIdxV]))
		{
			HCAN1.pTxMsg->RTR = CAN_RTR_REMOTE;
		}
		else
		{
			HCAN1.pTxMsg->RTR = CAN_RTR_DATA;
		}

		HCAN1.pTxMsg->DLC = atsCanMsgS[ubBufferIdxV].ubMsgDLC;

		for (i = 0; i < atsCanMsgS[ubBufferIdxV].ubMsgDLC; i++)
		{
			HCAN1.pTxMsg->Data[i] = atsCanMsgS[ubBufferIdxV].aubData[i];
		}

		if (HAL_CAN_Transmit_IT_MOD(&HCAN1, ubBufferIdxV, &tx_mailbox_to_buffer[0]) != HAL_OK)
		{
#ifdef DEBUG
			printf("Transmission error\r\n");
#endif
			return eCP_ERR_TRM_FULL;
		}
	}
	return (tvStatusT);
}

//----------------------------------------------------------------------------//
// CpCoreBufferSetData()                                                      //
//                                                                            //
//----------------------------------------------------------------------------//
CpStatus_tv CpCoreBufferSetData(CpPort_ts * ptsPortV, uint8_t ubBufferIdxV, uint8_t * pubSrcDataV, uint8_t ubStartPosV, uint8_t ubSizeV)
{
	CpStatus_tv tvStatusT;
	uint8_t ubCntT;

	//----------------------------------------------------------------
	// test parameter ptsPortV and ubBufferIdxV
	//
	tvStatusT = CheckParam(ptsPortV, ubBufferIdxV, eDRV_INFO_INIT);
	if (tvStatusT == eCP_ERR_NONE)
	{
		//--------------------------------------------------------
		// test start position and size
		//
		if ((ubStartPosV + ubSizeV) > CP_DATA_SIZE)
		{
			tvStatusT = eCP_ERR_PARAM;
		}
		else
		{
			//---------------------------------------------------
			// copy data from simulated CAN buffer
			//
			for (ubCntT = ubStartPosV; ubCntT < ubSizeV; ubCntT++)
			{
				CpMsgSetData(&atsCanMsgS[ubBufferIdxV], ubCntT, *pubSrcDataV);
				pubSrcDataV++;
			}
		}
	}
	return (tvStatusT);
}

//----------------------------------------------------------------------------//
// CpCoreBufferSetDlc()                                                       //
//                                                                            //
//----------------------------------------------------------------------------//
CpStatus_tv CpCoreBufferSetDlc(CpPort_ts * ptsPortV, uint8_t ubBufferIdxV, uint8_t ubDlcV)
{
	CpStatus_tv tvStatusT;

	//----------------------------------------------------------------
	// test parameter ptsPortV and ubBufferIdxV
	//
	tvStatusT = CheckParam(ptsPortV, ubBufferIdxV, eDRV_INFO_INIT);
	if (tvStatusT == eCP_ERR_NONE)
	{
		//--------------------------------------------------------
		// write DLC to simulated CAN buffer
		//
		atsCanMsgS[ubBufferIdxV].ubMsgDLC = ubDlcV;
	}

	return (tvStatusT);
}

//----------------------------------------------------------------------------//
// CpCoreCanMode()                                                            //
//                                                                            //
//----------------------------------------------------------------------------//
CpStatus_tv CpCoreCanMode(CpPort_ts * ptsPortV, uint8_t ubModeV)
{
	HAL_StatusTypeDef hal_status = HAL_OK;
	CpStatus_tv tvStatusT = eCP_ERR_CHANNEL;

	//----------------------------------------------------------------
	// test CAN port
	//
	if (ptsPortV != (CpPort_ts *) 0L)
	{
		if (ptsPortV->ubDrvInfo > eDRV_INFO_OFF)
		{
			tvStatusT = eCP_ERR_NONE;
//----------------------------------------------------------------
// switch CAN controller into mode "ubModeV"
//
			switch (ubModeV)
			{
				//--------------------------------------------------------
				// Stop the CAN controller (passive on the bus)
				//
				case eCP_MODE_STOP:

					// Disable Transmit mailbox empty Interrupt
					__HAL_CAN_DISABLE_IT(&HCAN1, CAN_IT_TME);

					// Disable FIFO 0 message pending Interrupt
					__HAL_CAN_DISABLE_IT(&HCAN1, CAN_IT_FMP0);

					// Disable FIFO 1 message pending Interrupt
					__HAL_CAN_DISABLE_IT(&HCAN1, CAN_IT_FMP1);

					// Disable Error warning, Error passive, Bus-off, Last error code and Error Interrupts
					__HAL_CAN_DISABLE_IT(&HCAN1, CAN_IT_EWG | CAN_IT_EPV | CAN_IT_BOF | CAN_IT_LEC | CAN_IT_ERR);

					// Request initialization
					HAL_CAN_Sleep(&HCAN1);

					break;

					//--------------------------------------------------------
					// Start the CAN controller (active on the bus)
					//
				case eCP_MODE_START:

					// Disable Transmit mailbox empty Interrupt
					__HAL_CAN_ENABLE_IT(&HCAN1, CAN_IT_TME);

					// Disable FIFO 0 message pending Interrupt
					__HAL_CAN_ENABLE_IT(&HCAN1, CAN_IT_FMP0);

					// Request initialization
					HAL_CAN_WakeUp(&HCAN1);

					break;

					//--------------------------------------------------------
					// Start the CAN controller (Listen-Only)
					//
				case eCP_MODE_LISTEN_ONLY:
					HCAN1.Init.Mode = CAN_MODE_SILENT;

					// Enable Transmit mailbox empty Interrupt
					__HAL_CAN_ENABLE_IT(&HCAN1, CAN_IT_TME);

					// Enable FIFO 0 message pending Interrupt
					__HAL_CAN_ENABLE_IT(&HCAN1, CAN_IT_FMP0);
					HCAN1.Init.Mode = CAN_MODE_SILENT;
					hal_status = HAL_CAN_Init(&HCAN1);

					break;

					//--------------------------------------------------------
					// Other modes are not supported
					//
				default:
					return (eCP_ERR_NOT_SUPPORTED);
					break;
			}
		}
	}

