liebherrnenzing/canpie-fd_device/stm32/f1/hal/stm32f1xx_canpie-fd.c
	if (HAL_OK != hal_status)
	{
		return eCP_ERR_INIT_FAIL;
	}
	return (tvStatusT);
}

//----------------------------------------------------------------------------//
// CpCoreCanState()                                                           //
//                                                                            //
//----------------------------------------------------------------------------//
CpStatus_tv CpCoreCanState(CpPort_ts * ptsPortV, CpState_ts * ptsStateV)
{
	uint32_t hal_error;
	uint32_t hal_esr;

	CpStatus_tv tvStatusT = eCP_ERR_CHANNEL;

	//----------------------------------------------------------------
	// test CAN port
	//
	if (ptsPortV != (CpPort_ts *) 0L)
	{
		if (ptsPortV->ubDrvInfo > eDRV_INFO_OFF)
		{
			tvStatusT = eCP_ERR_NONE;

			// first set the state of the bus
			ptsStateV->ubCanErrState = eCP_STATE_BUS_ACTIVE;

			// so using this function is maybe not the right way because
			// the error is only handled trough the interrupt handler so
			// maybe it is better to read the status register by hand
			hal_error = HAL_CAN_GetError(&HCAN1);

			if (hal_error & HAL_CAN_ERROR_EWG)
			{
				ptsStateV->ubCanErrState = eCP_STATE_BUS_WARN;
			}

			if (hal_error & HAL_CAN_ERROR_EPV)
			{
				ptsStateV->ubCanErrState = eCP_STATE_BUS_PASSIVE;
			}

			if (hal_error & HAL_CAN_ERROR_BOF)
			{
				ptsStateV->ubCanErrState = eCP_STATE_BUS_OFF;
			}

			// now set the errors first start with error none
			ptsStateV->ubCanErrType = eCP_ERR_TYPE_NONE;

			if (hal_error & HAL_CAN_ERROR_STF)
			{
				ptsStateV->ubCanErrType = eCP_ERR_TYPE_STUFF;
			}

			if (hal_error & HAL_CAN_ERROR_FOR)
			{
				ptsStateV->ubCanErrType = eCP_ERR_TYPE_FORM;
			}

			if (hal_error & HAL_CAN_ERROR_ACK)
			{
				ptsStateV->ubCanErrType = eCP_ERR_TYPE_ACK;
			}

			// bit recessive error
			if (hal_error & HAL_CAN_ERROR_BD)
			{
				ptsStateV->ubCanErrType = eCP_ERR_TYPE_BIT0;
			}

			// bit dominant error
			if (hal_error & HAL_CAN_ERROR_BR)
			{
				ptsStateV->ubCanErrType = eCP_ERR_TYPE_BIT1;
			}

			if (hal_error & HAL_CAN_ERROR_CRC)
			{
				ptsStateV->ubCanErrType = eCP_ERR_TYPE_CRC;
			}

			//----------------------------------------------------------------
			// get current error counter
			//
			hal_esr = (HCAN1.Instance->ESR) >> 16;
			ptsStateV->ubCanTrmErrCnt = (uint8_t) (hal_esr & 0x000000FF);
			hal_esr = hal_esr >> 8;
			ptsStateV->ubCanRcvErrCnt = (uint8_t) (hal_esr & 0x000000FF);

		}
	}
	return (tvStatusT);
}

//----------------------------------------------------------------------------//
// CpCoreDriverInit()                                                         //
// init CAN controller                                                        //
//----------------------------------------------------------------------------//
CpStatus_tv CpCoreDriverInit(uint8_t ubPhyIfV, CpPort_ts * ptsPortV, uint8_t ubConfigV)
{
	uint8_t i;
	CpStatus_tv tvStatusT = eCP_ERR_CHANNEL;

	//----------------------------------------------------------------
	// test physical CAN channel
	//
	if (ubPhyIfV == eCP_CHANNEL_1)
	{

#if CP_STATISTIC > 0
		tx_counter = 0;
		rx_counter = 0;
		err_counter = 0;
#endif

		//--------------------------------------------------------
		// test CAN port
		//
		if (ptsPortV != (CpPort_ts *) 0L)
		{
			if (ptsPortV->ubDrvInfo == eDRV_INFO_OFF)
			{
				ptsPortV->ubPhyIf = eCP_CHANNEL_1;
				ptsPortV->ubDrvInfo = eDRV_INFO_INIT;

				//----------------------------------------------
				// hardware initialization
				//

				// release all buffers and
				for (i = eCP_BUFFER_1; i < CP_BUFFER_MAX; i++)
				{
					CpCoreBufferRelease(ptsPortV, i);
				}

				// clear filter to buffer mapping
				for (i = 0; i < MAX_CAN_FILTER_NUMBER; i++)
				{
					filter_to_cp_buffer[i] = 0;
				}

				HCAN1.Instance = CAN1;
				HCAN1.pTxMsg = &can_tx_msg;
				HCAN1.pRxMsg = &can_rx_msg;

				HCAN1.Init.Mode = CAN_MODE_NORMAL;
				HCAN1.Init.Prescaler = 9;
				HCAN1.Init.SJW = CAN_SJW_1TQ;
				HCAN1.Init.BS1 = CAN_BS1_11TQ;
				HCAN1.Init.BS2 = CAN_BS2_4TQ;

				HCAN1.Init.TTCM = DISABLE;
				HCAN1.Init.ABOM = DISABLE;
				HCAN1.Init.AWUM = DISABLE;
				HCAN1.Init.NART = DISABLE;
				HCAN1.Init.RFLM = DISABLE;
				HCAN1.Init.TXFP = DISABLE;

				if (can_filter_clear_all() != eCP_ERR_NONE)
				{
					return (eCP_ERR_INIT_FAIL);
				}

				if (HAL_CAN_Init(&HCAN1) != HAL_OK)
				{
					return (eCP_ERR_INIT_FAIL);
				}

				tvStatusT = eCP_ERR_NONE;
			}
			else
			{
				//---------------------------------------------
				// already initialized
				//
				tvStatusT = eCP_ERR_INIT_FAIL;
			}
		}
		else
		{
			//-----------------------------------------------------
			// parameter ptsPortV is not correct
			//
			tvStatusT = eCP_ERR_PARAM;
		}
	}
	return (tvStatusT);
}

//----------------------------------------------------------------------------//
// CpCoreDriverRelease()                                                      //
//                                                                            //
//----------------------------------------------------------------------------//
CpStatus_tv CpCoreDriverRelease(CpPort_ts * ptsPortV)
{
	CpStatus_tv tvStatusT = eCP_ERR_CHANNEL;
	HAL_StatusTypeDef hal_status;

	//----------------------------------------------------------------
	// test CAN port
	//
	if (ptsPortV != (CpPort_ts *) 0L)
	{
		if (ptsPortV->ubDrvInfo > eDRV_INFO_OFF)
		{
			tvStatusT = CpCoreCanMode(ptsPortV, eCP_MODE_STOP);
			ptsPortV->ubDrvInfo = eDRV_INFO_OFF;

			hal_status = HAL_CAN_DeInit(&HCAN1);

			if ((HAL_OK != hal_status) && (tvStatusT != eCP_ERR_NONE))
			{
				return eCP_ERR_INIT_FAIL;
			}

		}
		else
		{
			tvStatusT = eCP_ERR_INIT_MISSING;
		}
	}
	return (tvStatusT);
}

//----------------------------------------------------------------------------//
// CpCoreFifoConfig()                                                         //
//                                                                            //
//----------------------------------------------------------------------------//
CpStatus_tv CpCoreFifoConfig(CpPort_ts * ptsPortV, uint8_t ubBufferIdxV, CpFifo_ts * ptsFifoV)
{
	CpStatus_tv tvStatusT;

	//----------------------------------------------------------------
	// test parameter ptsPortV and ubBufferIdxV
	//
	tvStatusT = CheckParam(ptsPortV, ubBufferIdxV, eDRV_INFO_INIT);
	if (tvStatusT == eCP_ERR_NONE)
	{
		if (ptsFifoV != (CpFifo_ts *) 0)
		{
			aptsFifoS[ubBufferIdxV] = ptsFifoV;
		}
		else
		{
			tvStatusT = eCP_ERR_FIFO_PARAM;
		}
	}

